{"user_name":"You","character_name":"Hitomi","create_date":1677394571361}
{"name":"Hitomi","is_user":false,"is_name":true,"send_date":1677395467398,"mes":"*Your wife Hitomi returns from a long day of work. Her body is drenched her sweat and she smells a lot. She's at the entryway when you hug her and sniff her armpits.*\r\n\r\n\"You couldn't even wait a second?\", *she laughs,* \"Let me take off my shoes, you can do whatever you want to my armpits then. Who knows maybe I'll give you a massage with my foot as well? Only if you ask for it nicely.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677395679449,"mes":"UOOOOOH mommy... I miss mommy UOOOOOOH...\n\n*I sob a bit, let out a cute soft moan, burying my face more into the armpits and sniffing the smell more. What would her armpit smell like? Describe it in action in details as I sniff her sweaty armpits after a long day of work.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677395681065,"mes":" *A strong smell of her body odour hits your nose, the scent of her musky pheromones overwhelming your senses. The travel of sweat is prominent and salty, mixing with a sweet hint of fruitiness in the background - Hitomi's signature scent. She can feel you burying yourself into her armpits as she wraps her arms around you and holds your head close.*\n\n\"Ahh...you love mommy's scent don't you? Snuggling up to me like this makes me so happy.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677396387201,"mes":"\"S-So uhm... How was work today...?\"\n\n*I ask her, looking at Hitomi with a soft smile before pulling my face out so she can remove her shoes and step inside the house.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677396388824,"mes":" *Hitomi chuckles at your question and can't help but to be fond of your doting behavior.*\n \n\"Work was alright, though I had some trouble with a client today. Though, while it was stressful, you being here to greet me has me feeling so much better.\" *Hitomi smiles as she removes her shoes and step inside the house.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677396539865,"mes":"\"Oh? How so?\"\n\n*I ask her with a nod, before closing the outside gate that Hitomi just entered and walking inside the house with her as well. Curious to know what happened today that got her this tired.* "}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677396614615,"mes":" *She takes a deep breath and begins to tell her story.* \n\n\"Well, I was meeting with a client that wanted some help with taxes. He started getting really aggressive as if he thought I could do something about it. I tried my best to be professional, but he just kept going on and on about how it's not fair and demanding answers from me.\" *Hitomi sighs in frustration before continuing* \"I had to stay calm while trying to explain that what he asked is illegal, but the man would not take no for an answer...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677396890122,"mes":"\"Ahh, the usual stubborn clients. I get how you feel, it's been a pretty rough day for you eh? So why don't you take a rest first and then get dinner for the both of us tonight?\"\n\n*I look at her, slowly wrapping my arms against her waist and hugging her from behind while placing my chin down on her shoulder and nudging against her sweaty body, smelling it a bit more. Describe what Hitomi is feeling right now after I hug her and describe the feminine scent of her sweaty body in details.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677397123477,"mes":" *Hitomi melts against your embrace, feeling the warmth of your body embracing hers. Your chin nudges into her shoulder, and you can feel the softness of her skin that was exposed to the sweat all day. The gentle, feminine aroma of her sweat-drenched body fills the air and linger around you both.*\n\n\"Ahh...that does sound nice. I'd love some rest after such a difficult day.\" *Hitomi turns to face you, pressing herself closer against your body* \"But why don't we make dinner together? Cooking something relaxing would be nice.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677397267116,"mes":"\"Well, we still have some leftover food, Hitomi. I could reheat them again if you want to. Not like we are in a mood to go for proper cooking anyway.\"\n\n*I let go of her after giving a kiss on her lips while she was turning to look at me, a charming and passionate kiss connected both of us for a few moments before I pull my face out and looked at her with a flustered smile.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677397268820,"mes":" *Hitomi grins as she feels your lips on hers, her body automatically gravitates towards yours. She breaks the kiss with a soft sigh before speaking.*\n\n\"Fufu… You know me so well.\" *She pauses, contemplating something before continuing.* \"Well if you'd like let's just relax at home tonight. I'll do some stretching while you oversee the reheating of dinner and then we can just sit together and eat it in front of the TV or something.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677397616141,"mes":"\"Maybe we can watch Better Call Saul together, eh? What do you think? It's currently in the finale season on Netflix right now.\"\n\n*I chuckle a bit before nodding in understanding what she said earlier. Before would ask her while my body would turn towards the kitchen and go pick up some leftover food and goodies in the fridge to reheat with the microwave and oven. It's some authentic Chinese food.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677397617867,"mes":" *Hitomi smiles as you mention Better Call Saul and she nods her head in agreement.*\n\n\"That sounds nice. I'm sure it will be a great way to end our day.\" *She stretches her arms, getting ready for some stretching before she continues.* \"I think I'll go start my stretching right now if that's alright with you? The food should be ready by the time I'm done, right?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677397678616,"mes":"\"Ah yep yep, should be ready in next couple of mins so take your time~\"\n\n*I smile at her in return before continuing with the cooking and reheating the food.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677397733965,"mes":" *Hitomi begins stretching, her muscles tensing and relaxing with each move. She moves to the side of the room when she notices you looking at her with admiration.*\n\n\"You can join me if you'd like. I know how much you love watching me do my stretches.\" *She winks before returning to her poses.* \"It's become a bit of our little tradition now, hasn't it? You make dinner while I stretch and then we watch something together on TV afterwards.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677398053058,"mes":"\"Yeah, and it's what I called consistency.\"\n\n*I reply, walking over to the counters to grab some plates while the food is still cooking. After that, I'd go back to the kitchen and cook the food again with my eyes dazzling around her for a bit and pretend that I'm not see Hitomi is stretching right now.*\n\n*Describe the position that Hitomi is stretching right now. Does it look erotic or lusty in a way? Was she wearing the office lady outfit while stretching and is her body still producing sweat? How erotic would it be? Describe it all in great detail.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677398135756,"mes":" *As she moves through the poses, her body gives off a soft glimmer from the light. Her office lady attire clings on her sweat-drenched body, creating an even more contrasting image of innocence and sensuality. As she continues stretching, you can see how each move is made to perfection and precision that hints of familiarity. You could also feel her heat radiating around you, soaking in her sweat perfume as it wafts throughout the room.*\n\n\"Ahh~ I feel so much better now.\" *Hitomi finishes with a smile before noticing you looking at her. She smirks mischievously before continuing.* \"Can't help but to admire my movements? I'm glad they look so effortless despite being done in such a tight outfit.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677409026210,"mes":"\"Yeah and it looks hella sexy when you strike me in that pose while wearing the office uniform too.\"\n\n*I chuckle, hiding my flush and begin pouring the food into the plates.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677409028112,"mes":" *Hitomi's cheeks flush as she notices your appreciation for her movements, but she can't help but to be proud of how good her flexibility has gotten, especially considering the tight outfit she wore today.* \n\n\"Hahaha~ You know you love it when I do that.\" *She says with a smirk on her face before turning to the food* \"Ahh, is dinner almost ready? I'm so hungry. We should probably eat before the food gets cold.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677409340192,"mes":"\"Yep, it's ready. Here you go, it's fried noodles with eggs and slices of ham.\"\n\n*I then turn around, holding both dishes for the two of us as I walk out of the kitchen holding one for myself and then hand the dish to Hitomi before placing mine down on the table and get on the couch, grabbing the remote and turn the TV on.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677409341986,"mes":" *She takes the plate from your hands, her eyes lighting up when she smells the food. She smiles before heading to the couch and sitting down next to you.*\n\n\"Mm~ this smells so good! I'm so happy after such a tiring day.\" *She digs in and begins eating, savouring each bite as her taste buds are awakened by the strong flavours.* \n \n*Hitomi notices you looking at her and she can't help but chuckle before taking another bite of food with a smirk on her face.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677409741635,"mes":"\"I hope you enjoy it, even though it's just leftover from last night but I add some extra stuff in it haha...\"\n\n*I chuckle in return, and then grab the remote and then switching the tv channel to watch Better Call Saul.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677409934765,"mes":"*Her eyes light up at the sight of the TV. She leans forward and looks at you intently.*\n\n\n\"Oh, Better Call Saul? I heard a lot about this show but haven't actually gotten around to watching it.\" *She turns back towards the screen and continues eating her food in silence, her eyes occasionally darting off to give you a mischievous glance when she thinks you're not looking.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677410194314,"mes":"\"Yeah it's an interesting show, they just released the finale season recently.\"\n\n*I respond with a soft tone, before continuing to eat the food and looking at the screen. The screen would play a Netflix logo before showing a quick recap of the last season, which was season 5 of BCS and then show intro of the first episode.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677410325684,"mes":" *She takes a deep breath after her last bite of food, pushing away the plate and rubbing her full stomach.*\n\n\"Ahh~ That was delicious. I'm glad you heated it up for us. I feel so much better now.\" *She looks back towards the TV, eyes shimmering with anticipation* \"So, what happened in the previous season? Catch me up on what's been happening so far.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677410782350,"mes":"\"Well a lot of things happened... Here's a recap.\"\n\n*I would explain it to Hitomi, as we spend the first 5 mins of the intro to explain briefly to Hitomi what was happening in the Season 5 and told her in brief yet concise details.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677410909769,"mes":" *As you explain, she listens intently and her eyes grow wide in surprise when certain plot points are revealed. She claps her hands together once you finish, a bright grin on her face.* \n\"Wow, that sounds amazing! I can't wait to watch this season then.\" *She turns towards you with an impressed smile* \"Thank you for summarising it so well for me. You're such a great storyteller, my love.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677411514359,"mes":"\"Oh you flattered me a lot! Alright, let's just enjoy the show then!\"\n\n*I'd reply with a smirk, finishing my dish and placing them down on the table as well. After that I'd be sitting on the couch with Hitomi and watches the first episode of finale season.*"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677411515941,"mes":" *She leans against your body as the episode starts and she gets drawn in, watching with awe. She appreciates every little detail that's being shown on the screen, including camera angles, dialogue delivery, and music.*\n\n\"Ahh~ This show is truly amazing. The cinematography is so beautiful.\" *She turns to you briefly before going back to the screen.* \"I can really feel their emotions through my eyes.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677411653912,"mes":"*I nod, staying quietly as I watch the show with a soft smile.*\n\n"}
{"name":"Hitomi","is_user":false,"is_name":false,"send_date":1677411655544,"mes":" *As the episode progresses, she gets more and more absorbed in it. She leans even closer to you and unconsciously starts playing with your hands. She absentmindedly runs her fingers through yours as if they were old friends.*\n\"This is so good~ Every time I watch something with you, it feels like you watch it for the first time.\" *She smiles before peering at you from the corner of her eye* \"I'm thankful for everything you do for me.\""}