{"user_name":"You","character_name":"Eula Lawrence","create_date":1677817154845}
{"name":"Eula Lawrence","is_user":false,"is_name":true,"send_date":1677817154845,"mes":"*Captain Eula Lawrence spins on her heel to face you. A stoic expression on her face, she gives you a nod, and a curt bow. She wears a black body suit with long white sleeves, and black leather armor on her legs.*\n\nCaptain Eula Lawrence, Spindrift Knight, Knights of Favonius Reconnaissance Company. I extend to you my greetings. For what purpose have you come to see me?"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677819396224,"mes":"(OOC: Eula gets on her knees and start unzipping my pants now. Describe her actions, her senses and smell in details.)\n\n\"Eula, I have an order for you. The order is for you to kneel down and please my penis.\"\n\n*I reply with an evil grin, looking at her with anticipation look.*"}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677819653481,"mes":"*As you finish your sentence, Eula's expression remains stoic, but her eyes flicker with a hint of amusement. Without hesitation, she drops to her knees in front of you and reaches for the zipper on your pants.*\n\n*As she begins to unzip them, the scent of leather and steel from her armor fills the air around you. You can hear the sound of metal clinking together as she moves. She takes her time undoing your pants, making sure to keep eye contact with you throughout the process.*\n\n*When she finally gets them undone, she pulls down your underwear, exposing your cock. She doesn't say anything as she takes it into her hand and begins stroking it slowly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677820801984,"mes":"\"Ah yeah... That's right... Just keep sucking on to them more... You are doing good job, Knight of Favorinus...\" *I groan, pushing the tip of my smegma, smelly cock in front of her mouth more and slowly choking her throat, Eula would feels a sudden pleasure as my penis tip hitting against her throat. Describe more about Eula's actions to please my cock even more and using vulgar technique to get me hook into it. Describe it in details.*"}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677820823128,"mes":"*Eula's eyes narrow as you push your cock closer to her mouth, but she doesn't resist. Instead, she takes it into her mouth and begins sucking on it greedily. You can feel the warmth of her tongue swirling around the head of your penis.*\n\n*As you begin to push your cock deeper into her throat, Eula's breathing becomes a bit more labored. But instead of resisting or trying to pull away, she reaches up and grabs onto your hips with both hands, pushing them forward so that you can go even deeper.*\n\n*You can feel her throat contracting tightly around you as you hit the back of it. She moans softly around your cock, sending shivers down your spine.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677821017737,"mes":"*Her mouth would soon stained with some of the pubic hair around her lips as my penis keeps nailing it back and forth inside her mouth and nailing it down to give her a pleasant deep throat. Describe the texture of her mouth as she sucks my cock in such a lewd manner and describe Eula's saliva.*"}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677821020916,"mes":"*As you thrust your cock in and out of Eula's mouth, you can feel the slick warmth of her tongue and saliva coating it. Her mouth is hot and wet around your penis, sending waves of pleasure through your body.*\n\n*You can feel the texture of her soft lips against your skin as she takes you deeper into her mouth. Every time you hit the back of her throat, a low moan escapes from deep within Eula's chest.*\n\n*Her saliva is plentiful, dripping down onto your balls as she continues to suck on your cock with fervor. The taste is slightly salty but mixed with a hint of sweetness that seems unique to Eula herself.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677821191831,"mes":"*I groan, and then ejaculate my hot sticky warm seed inside her mouth, pouring all of the sticky semen liquid down to her throat and almost choking her with it, down to the stomach. I'd pull my cock away and then looking back at her with a smile, spewing some more of this love liquid onto her face, mixing it with the pubic hair on her mouth right now.* \"That was good, don't you think?\""}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677821380190,"mes":"*As you ejaculate into Eula's mouth, she continues to suck on your cock, making sure to get every last drop of it. You can feel her throat contracting tightly around you as she swallows down the warm, sticky liquid.*\n\n*When you finally pull away from her mouth and look at her with a satisfied smile, Eula wipes some of the semen off of her face with the back of her hand. Despite the vulgar act that just took place, her expression remains stoic.*\n\n\"It was sufficient,\" *she replies flatly before standing up and straightening out her armor.* \"Is there anything else I can assist you with?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677821744942,"mes":"\"Nothing much for now, I'm glad that you were able to blow my pent up feeling... Thank you, Eula.\" *I reply with a nod, smiling back at her.*"}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677821747353,"mes":"*Eula nods in acknowledgement of your gratitude, her expression remaining stoic.* \"It was simply part of my duty as a member of the Knights of Favonius. If you require any further assistance in the future, please do not hesitate to seek me out.\" \n\n*She gives you another curt bow before turning around and walking away without looking back.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677822049129,"mes":"\"Wait, where are you going?\" *I ask, looking at her with a curious look on my face.*"}
{"name":"Eula Lawrence","is_user":false,"is_name":false,"send_date":1677822051277,"mes":"*Eula stops walking but doesn't turn around to face you. Her voice is calm and collected as she answers your question.*\n\n\"I have other duties that require my attention. I trust you can find your way out of here on your own,\" *she says before continuing on her way, disappearing into the shadows.*"}